## Which product category and location should we target for our next ad campaign?

In [4]:
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
# Run this cell to import the sales dataset
data_url = 'https://raw.githubusercontent.com/datastray/python_project/main/sales_data.csv'
df = pd.read_csv(data_url)

# View first 5 rows of the dataset
df.head()

,transaction_ID,date,product_category,product_name,units_sold,unit_price,total_revenue,location
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_ID    245 non-null    int64
 1   date              245 non-null    object
 2   product_category  245 non-null    object
 3   product_name      245 non-null    object
 4   units_sold        245 non-null    int64
 5   unit_price        245 non-null    float64
 6   total_revenue     245 non-null    float64
 7   location          245 non-null    object
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB

In [10]:
# product category revenue totals
df.groupby(['product_category']).sum()

,transaction_ID,date,product_name,units_sold,unit_price,total_revenue,location
product_category,,,,,,,
Beauty Products,404880,2024-01-052024-01-112024-01-172024-01-232024-0...,Neutrogena Skincare SetChanel No. 5 PerfumeDys...,46,2464.92,2621.90,EuropeEuropeEuropeEuropeEuropeEuropeEuropeEuro...
Books,404840,2024-01-042024-01-102024-01-162024-01-222024-0...,"The Da Vinci CodeDune by Frank HerbertSalt, Fa...",114,646.12,1861.93,North AmericaNorth AmericaNorth AmericaNorth A...
Clothing,404800,2024-01-032024-01-092024-01-152024-01-212024-0...,Levi's 501 JeansNike Air Force 1North Face Dow...,145,2701.46,8128.93,AsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAs...
Electronics,455935,2024-01-012024-01-072024-01-132024-01-192024-0...,iPhone 14 ProMacBook Pro 16-inchSamsung Galaxy...,75,29632.62,37851.33,North AmericaNorth AmericaNorth AmericaNorth A...
Home Appliances,404760,2024-01-022024-01-082024-01-142024-01-202024-0...,Dyson V11 VacuumBlueair Classic 480iKeurig K-E...,59,12807.42,18646.16,EuropeEuropeEuropeEuropeEuropeEuropeEuropeEuro...
Sports,404920,2024-01-062024-01-122024-01-182024-01-242024-0...,Wilson Evolution BasketballBabolat Pure Drive ...,88,10451.36,14326.52,AsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAsiaAs...